Revit 2027 API
BuiltInFailures.TrussFailures.TrussLayoutOverlapedCurves Property
 The current transformation of this specific truss layout will some sub members to overlap.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussLayoutOverlapedCurves { get; }
Public Shared ReadOnly Property TrussLayoutOverlapedCurves As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussLayoutOverlapedCurves {
	FailureDefinitionId^ get ();
}
static member TrussLayoutOverlapedCurves : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace